# Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со
столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и
['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'],
[450, 300, 350, 500, 450, 370, 290]

In [1]:
import pandas as pd

In [4]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ["Тургенев", "Чехов", "Островский"]}, columns=['author_id', 'author_name'])

In [5]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [6]:
book = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ["Отцы и дети", "Рудин", "Дворянское гнездо", "Толстый и тонкий", "Дама с собачкой", 
                   "Гроза", "Таланты и поклонники"],
    'price': [450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price']
)

In [7]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [10]:
authors_price = pd.merge(authors, book, on="author_id", how="inner")
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

# Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.

In [12]:
top5 = authors_price.nlargest(5, 'price')
top5.reset_index()

   index  author_id author_name         book_title  price
0      3          2       Чехов   Толстый и тонкий    500
1      0          1    Тургенев        Отцы и дети    450
2      4          2       Чехов    Дама с собачкой    450
3      5          3  Островский              Гроза    370
4      2          1    Тургенев  Дворянское гнездо    350

# Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat
должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя
цена на книги этого автора.

In [19]:
mins = authors_price.groupby('author_name').agg('price').min()
maxs = authors_price.groupby('author_name').agg('price').max()
means = authors_price.groupby('author_name').agg('price').mean()

In [43]:
mins.name = 'min_price'
maxs.name = 'max_price'
means.name = 'mean_price'

### Вариант 1

In [45]:
authors_stat = pd.DataFrame({
    'author_name': mins.index,
    'min_price': mins.values,
    'max_price': maxs.values,
    'mean_price': means.values
}, columns=['author_name', 'min_price', 'max_price', 'mean_price'])

In [25]:
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

### Вариант 2

In [46]:
authors_stat = pd.concat([mins, maxs, means], axis=1)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

# Задание 5**

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться
данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные
из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого
автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого
функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами
должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при
необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием
"book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь,
что датафреймы book_info и book_info2 идентичны

In [48]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [50]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [53]:
import numpy as np

In [83]:
book_info = pd.pivot_table(authors_price, 
                       values='price', 
                       index=['author_name'], 
                       columns=['cover'], 
                       aggfunc=np.sum)

In [84]:
# выведем сводную таблицу
book_info

cover        мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [85]:
book_info.fillna(0, inplace=True)

In [86]:
# выведем результат
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [87]:
# запишем в файл
book_info.to_pickle("book_info.pkl")

In [88]:
!ls *.pkl

book_info.pkl

In [89]:
# прочитаем из файла в новый датафрйм
book_info2 = pd.read_pickle("book_info.pkl")

### Попытка сравнить два датасета

In [90]:
diff = pd.merge(book_info, book_info2, how='outer', on=['author_name'], suffixes=['_1', '_2'], indicator=True)

In [91]:
diff

cover        мягкая_1  твердая_1  мягкая_2  твердая_2 _merge
author_name
Островский      660.0        0.0     660.0        0.0   both
Тургенев        650.0      450.0     650.0      450.0   both
Чехов             0.0      950.0       0.0      950.0   both